IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_xbar_regs.xml
	<register id="XBARCLR2" width="32" page="1" offset="0xa" internal="0" description="X-Bar Input Flag Clear Register 2">
		<bitfield id="INPUT1" description="Input Flag Clear for INPUT1 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INPUT2" description="Input Flag Clear for INPUT2 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INPUT3" description="Input Flag Clear for INPUT3 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INPUT4" description="Input Flag Clear for INPUT4 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INPUT5" description="Input Flag Clear for INPUT5 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INPUT6" description="Input Flag Clear for INPUT6 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCSOCA" description="Input Flag Clear for ADCSOCA Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCSOCB" description="Input Flag Clear for ADCSOCB Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INPUT7" description="Input Flag Clear for INPUT7 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INPUT8" description="Input Flag Clear for INPUT8 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INPUT9" description="Input Flag Clear for INPUT9 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INPUT10" description="Input Flag Clear for INPUT10 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INPUT11" description="Input Flag Clear for INPUT11 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INPUT12" description="Input Flag Clear for INPUT12 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INPUT13" description="Input Flag Clear for INPUT13 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INPUT14" description="Input Flag Clear for INPUT14 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ECAP1_OUT" description="Input Flag Clear for ECAP1.OUT Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2_OUT" description="Input Flag Clear for ECAP2.OUT Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3_OUT" description="Input Flag Clear for ECAP3.OUT Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4_OUT" description="Input Flag Clear for ECAP4.OUT Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5_OUT" description="Input Flag Clear for ECAP5.OUT Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6_OUT" description="Input Flag Clear for ECAP6.OUT Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="EXTSYNCOUT" description="Input Flag Clear for EXTSYNCOUT Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT1" description="Input Flag Clear for ADCAEVT1 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT2" description="Input Flag Clear for ADCAEVT2 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT3" description="Input Flag Clear for ADCAEVT3 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT4" description="Input Flag Clear for ADCAEVT4 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT1" description="Input Flag Clear for ADCBEVT1 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT2" description="Input Flag Clear for ADCBEVT2 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT3" description="Input Flag Clear for ADCBEVT3 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT4" description="Input Flag Clear for ADCBEVT4 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT1" description="Input Flag Clear for ADCCEVT1 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR3" width="32" page="1" offset="0xc" internal="0" description="X-Bar Input Flag Clear Register 3">
		<bitfield id="ADCCEVT2" description="Input Flag Clear for ADCCEVT2 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT3" description="Input Flag Clear for ADCCEVT3 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT4" description="Input Flag Clear for ADCCEVT4 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT1" description="Input Flag Clear for ADCDEVT1 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT2" description="Input Flag Clear for ADCDEVT2 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT3" description="Input Flag Clear for ADCDEVT3 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCDEVT4" description="Input Flag Clear for ADCDEVT4 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_COMPL" description="Input Flag Clear for SD1FLT1.COMPL Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_COMPH" description="Input Flag Clear for SD1FLT1.COMPH Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPL" description="Input Flag Clear for SD1FLT2.COMPL Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPH" description="Input Flag Clear for SD1FLT2.COMPH Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPL" description="Input Flag Clear for SD1FLT3.COMPL Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPH" description="Input Flag Clear for SD1FLT3.COMPH Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPL" description="Input Flag Clear for SD1FLT4.COMPL Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPH" description="Input Flag Clear for SD1FLT4.COMPH Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_COMPL" description="Input Flag Clear for SD2FLT1.COMPL Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_COMPH" description="Input Flag Clear for SD2FLT1.COMPH Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPL" description="Input Flag Clear for SD2FLT2.COMPL Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPH" description="Input Flag Clear for SD2FLT2.COMPH Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPL" description="Input Flag Clear for SD2FLT3.COMPL Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPH" description="Input Flag Clear for SD2FLT3.COMPH Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPL" description="Input Flag Clear for SD2FLT4.COMPL Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPH" description="Input Flag Clear for SD2FLT4.COMPH Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7_OUT" description="Input Flag clear for ECAP7.OUT Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_COMPZ" description="Input Flag clear for SD1FLT1.COMPZ Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_DRINT" description="Input Flag clear for SD1FLT1.DRINT Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPZ" description="Input Flag clear for SD1FLT2.COMPZ Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_DRINT" description="Input Flag clear for SD1FLT2.DRINT Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPZ" description="Input Flag clear for SD1FLT3.COMPZ Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_DRINT" description="Input Flag clear for SD1FLT3.DRINT Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPZ" description="Input Flag clear for SD1FLT4.COMPZ Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_DRINT" description="Input Flag clear for SD1FLT4.DRINT Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR4" width="32" page="1" offset="0xe" internal="0" description="X-Bar Input Flag Clear Register 4">
		<bitfield id="SD2FLT1_COMPZ" description="Input Flag clear for SD2FLT1.COMPZ Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_DRINT" description="Input Flag clear for SD2FLT1.DRINT Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPZ" description="Input Flag clear for SD2FLT2.COMPZ Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_DRINT" description="Input Flag clear for SD2FLT2.DRINT Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPZ" description="Input Flag clear for SD2FLT3.COMPZ Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_DRINT" description="Input Flag clear for SD2FLT3.DRINT Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPZ" description="Input Flag clear for SD2FLT4.COMPZ Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_DRINT" description="Input Flag clear for SD2FLT4.DRINT Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT4" description="Input Flag clear for CLB1_OUT4 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT5" description="Input Flag clear for CLB1_OUT5 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT4" description="Input Flag clear for CLB2_OUT4 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT5" description="Input Flag clear for CLB2_OUT5 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT4" description="Input Flag clear for CLB3_OUT4 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT5" description="Input Flag clear for CLB3_OUT5 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT4" description="Input Flag clear for CLB4_OUT4 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT5" description="Input Flag clear for CLB4_OUT5 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLAHALT" description="Input Flag clear for CLAHALT Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
</module>
